Revit 2027 API
AdaptiveComponentFamilyUtils.SetPointOrientationType Method
 Sets orientation type of an Adaptive Placement Point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void SetPointOrientationType(
	Document doc,
	ElementId refPointId,
	AdaptivePointOrientationType orientationType
)
Public Shared Sub SetPointOrientationType (
	doc As Document,
	refPointId As ElementId,
	orientationType As AdaptivePointOrientationType
)
public:
static void SetPointOrientationType(
	Document^ doc,
	ElementId^ refPointId,
	AdaptivePointOrientationType orientationType
)
static member SetPointOrientationType :
        doc : Document *
        refPointId : ElementId *
        orientationType : AdaptivePointOrientationType -> unit
Parameters
doc Document
 The Document
refPointId ElementId
 The ReferencePoint id
orientationType AdaptivePointOrientationType
 Orientation type of the Adaptive Placement Point.
Exceptions
Exception | Condition
ArgumentException |  The ElementId refPointId does not correspond to a valid ReferencePoint. -or- The Element corresponding to ElementId refPointId does not belong to an Adaptive Family. -or- The ElementId refPointId does not correspond to an Adaptive Placement Point.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  This operation failed.
See Also
Reference
AdaptiveComponentFamilyUtils Class
Autodesk.Revit.DB Namespace